Revit 2024 API
BuiltInFailures.RebarFailures.InvalidRebarHostWrongCategory Property
 Rebar can't be placed in a family of category [Name].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidRebarHostWrongCategory { get; }
Visual Basic
Public Shared ReadOnly Property InvalidRebarHostWrongCategory As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidRebarHostWrongCategory {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace